// 1
// Создайте три переменные.Присвойте первой переменной числовое значение.
// Вторая переменная равна первой переменной, увеличенной в три раза.
// Третья переменная равна сумме двух первых.Выведите на экран все три

// let first = 10;
// let second = first * 3;
// let third = first + second
// console.log(first, second, third);


// 2
// Создайте переменные firstName и lastName для хранения имени и фамилии, 
// запишите в них значения из модального окна prompt. 
// Выведите на экран приветствие “What’s up (firstName) (lastName)”.

// let firstName = prompt('What is your name?', 'Yana');
// let lastName  = prompt('What is your Last name?', 'Shevchenko');
// alert(`What’s up ${firstName} ${lastName} ?`);


// 3
// Создайте переменные x и y для хранения числа. 
// Значения переменные получают из prompt. 
// Рассчитайте произведение, частное, разность и сумму этих значений. 
// Результат последовательно отобразите в модальном окне.

// let x = +prompt('Введите первое число', 40);
// let y = +prompt('Введите второе число', 8);
// sum = x + y;
// min = x - y;
// multip = x * y;
// div = x / y;
// alert(`Сумма чисел: ${sum}`);
// alert(`Вычитание чисел: ${min}`);
// alert(`Умножение чисел: ${multip}`);
// alert(`Деление чисел: ${div}`);

// 4
// Напишите в переменных формулу для расчета з/п за июль с учетом, 
// что количество рабочий часов, количество рабочих дней в неделе и рейт за час – значения читаются из prompt. 
// (Просчитывать какой это месяц, 30 или 31 день не нужно).

// let workHours = +prompt('Количество рабочих часов в неделе', 40);
// let workDays = +prompt('Количество рабочих дней в неделе ', 5);
// let costHour = +prompt('Рейт за час', 150);
// let weeksMonth = 31 / 7;
// salary = ((workHours / workDays) * costHour) * (workDays * +weeksMonth.toFixed(2));
// console.log(salary);

// 5
// Напишите программу, которая определяет, является ли число, введенное пользователем, нечётным.

// let oddNumber = +prompt('Введите любое число');
// if (oddNumber % 2 == 0) alert ("четное");
// else alert ("нечетное");

// 6
// Напишите программу, которая проверяет является ли значение, введенное пользователем, числом

// let numberUser = +prompt('Введите любое значение');
// if (typeof numberUser === '' || isNaN(numberUser)) {
//     console.log(numberUser + " - было введено не число");
// } else  {
//     console.log(numberUser + " - введено число");
// }


// 7
// Запишите в переменную случайное число (Math.random()), умножьте его на 100 и округлите. 
// Получите второе число из окна prompt. Сравните и отобразите в модальном окне: 
// первое число меньше второго или нет, а также оба значения.

// let randomNumber = Math.random() * 100;
// randomNumber = Math.round(randomNumber);
// let userNumber = +prompt('Введите любое число', 45);
// randomNumber < userNumber ? alert(`${randomNumber} меньше ${userNumber}`) : alert(`${randomNumber} больше ${userNumber}`);

// 8
// Создайте переменную str и запишите в нее из prompt такое предложение «Мне нравится изучать Front-end». 
// Также создайте еще одну переменную и запишите в нее из prompt то, что вам нравится изучать. 
// С помощью методов строки определите существует ли то что вам нравится изучать в исходной строке str. 
// Также возьмите подстроку «Мне нравится изучать » из исходной переменной str сохраните ее в отдельной переменной. 
// Создайте еще одну переменную result куда запишите результирующую строку объединяющую «Мне нравится изучать » 
// и то что вам нравится изучать (примените для этого обратные кавычки ` `). Отобразите результат в модальном окне.

// let str = prompt("", "Мне нравится изучать Front-end");
// let strSecond = prompt("Мне нравится изучать", "JavaScript"); //JavaScript
// let partStrSecond = strSecond.slice(-10);
// str.includes(partStrSecond) === true ? alert(`Есть в исходной строке str: ${partStrSecond}`) : alert(`Нет в исходной строке str: ${partStrSecond}`);
// let newStr = str.slice(0, 21);
// let result = alert(`${newStr} ${partStrSecond}`);